{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_13", "units": 50, "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "dtype": "float32", "activation": "linear", "batch_input_shape": [null, 9]}, "class_name": "Dense"}, {"config": {"name": "dropout_7", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 0.019999999552965164, "name": "leaky_re_lu_1", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "units": 25, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_14", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "linear", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_8", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"alpha": 0.019999999552965164, "name": "leaky_re_lu_2", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "units": 12, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_15", "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "seed": null}, "class_name": "RandomNormal"}, "activation": "linear", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "units": 1, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_16", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.0.4", "class_name": "Sequential"}